const a = ` Вінницька
	

1557212
	

1558803
	

1550127
	

1551718

Волинська
	

1034655
	

1034992
	

1031927
	

1032264

Дніпропетровська
	

3200909
	

3203693
	

3197600
	

3200384

Донецька
	

4160122
	

4163012
	

4147237
	

4150127

Житомирська
	

1217936
	

1219064
	

1218705
	

1219833

Закарпатська
	

1256073
	

1256437
	

1253240
	

1253604

Запорізька
	

1702766
	

1704301
	

1701977
	

1703512`

function test () {
    let b = a.search(/[А-і]\s+\d+/g);
    for (let i = 0; i <= b.length; i++) {
        b[i].replace(/[^А-і0-9]/, ':')
    }
    console.log(b)
}

test();